# Shadowrocket节点正则
# 保留节点名称含有关键词A和B的节点:
# (?=.*(A))^(?=.*(B))^.*$
# 保留节点名称含有关键词A或B的节点:
# A|B
# 排除节点名称含有关键词A或B的节点:
# ^((?!(A|B)).)*$
# 保留节点名称含有关键词A并排除含有关键词B的节点:
# (?=.*(A).)^((?!(B)).)*$

# 香港示例⏰ (?=.*(港|HK|(?i)Hong))^((?!(台|日|韩|新|美)).)*$
# 美国示例⏰ (?=.*(美|US|(?i)States|American))^((?!(港|台|日|韩|新)).)*$
# 韩国示例⏰ (?=.*(韩|KR|(?i)Korea|korea|KOR))^((?!(港|台|日|美|新)).)*$
# 台湾示例⏰ (?=.*(台|TW|Taiwan|台湾(?i)TW|Tai|Taiwan))^((?!(港|日|美|韩|新)).)*$
# 新加坡示例⏰ (?=.*(新|SG|Singapore|新加坡(?i)SG|Singapore))^((?!(港|台|美|韩|日)).)*$
# 其他节点示例⏰ ^((?!套餐|到期|余额|剩余|流量|邀请|返利|循环|官网|客服|网站|网址|获取|订阅|流量|到期|机场|下次|版本|官址|备用|到期|过期|已用|联系|邮箱|工单|群|贩卖|通知|倒卖|假|延迟|防止|国内|官网|🇭🇰|港|HK|Hong|🇹🇼|台|TW|Tai|🇯🇵|日|JP|Japan|🇸🇬|坡|狮城|SG|Singapore|🇰🇷|韩|KR|KOR|Korea|🇺🇸|美|US|States|American|🇬🇧|英国|英|英格兰|UK|United Kingdom).)*$

^((?!(邀请|返利|循环|请|更换|官网|客服|网站|网址|获取|订阅|流量|到期|机场|下次|版本|官址|备用|到期|过期|已用|联系|邮箱|工单|群|贩卖|通知|倒卖|假|延迟|无法使用|软件内更新订阅|在官网查看问题|防止|国内|加入)).)*$
